Catalogs/НоменклатураГТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НоменклатураГТД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодУКТВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТВЭД_Индекс</Name>
					<Comment>для сортировки списка справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД_Индекс</Name>
					<Comment>для сортировки списка справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГТД_Индекс</Name>
					<Comment>для сортировки списка справочника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатураГТД/Ext/ObjectModule.bsl
Процедура ОбновлениеИндексныхПолей() Экспорт

	// заполним ссылочные реквизиты, которые позволят сортировать список справочника.
	КодУКТВЭД_Индекс = КодУКТВЭД.Код;
	НомерГТД_Индекс  = НомерГТД.Код;
	ДатаГТД_Индекс   = НомерГТД.Дата;
	
	// создадим наименование, которое будет использоваться для отображения элемента
	
	Наименование = КодУКТВЭД.Наименование + ?(ЗначениеЗаполнено(НомерГТД_Индекс), ", ВМД №: " + НомерГТД_Индекс + " від " + Формат(ДатаГТД_Индекс, "ДФ=dd.MM.yy"), "");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИндексныхПолей();
	
	// не будем записывать дубли
	Если НЕ ОбменДанными.Загрузка Тогда
	
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("КодУКТВЭД", КодУКТВЭД);
		Запрос.УстановитьПараметр("НомерГТД",  НомерГТД);
		Запрос.УстановитьПараметр("Владелец",  Владелец);
		Запрос.УстановитьПараметр("Ссылка",    Ссылка);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	НоменклатураГТД.Ссылка
		               |ИЗ
		               |	Справочник.НоменклатураГТД КАК НоменклатураГТД
		               |ГДЕ
		               |	НЕ НоменклатураГТД.Ссылка = &Ссылка
		               |	И НоменклатураГТД.КодУКТВЭД = &КодУКТВЭД
		               |	И НоменклатураГТД.НомерГТД = &НомерГТД
		               |	И НоменклатураГТД.Владелец = &Владелец";
					   
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для номенклатуры %1 уже имеется запись в справочнике ""Коды номенклатуры для НН"" с такими же Кодом и номером ГТД!';uk='Для номенклатури %1 вже є запис у довіднику ""Коди номенклатури для ПН"" з такими ж Кодом і номером ВМД!'"), Владелец));
		КонецЕсли;					   	
	
	КонецЕсли;
	
КонецПроцедуры
